package net.sunwukong.www.api.enums;

/**
 * Created by 18547 on 2018/6/21.
 */
public enum SysCode {

    //用户性别 1001
    CODE_10010001("10010001","先生"),
    CODE_10010002("10010002","女士"),

    //用户类型 1002
    CODE_10020001("10020001","普通用户"),
    CODE_10020002("10020002","城市管理者"),
    CODE_10020003("10020003","猴王服务机构"),
    CODE_10020004("10020004","个体服务者"),

    //用户状态 1003
    CODE_10030001("10030001","正常"),
    CODE_10030002("10030002","注销"),

    //账户变动方式 1005
    CODE_10050001("10050001","注册"),
    CODE_10050002("10050002","发布"),
    CODE_10050003("10050003","返利"),
    CODE_10050004("10050004","充值"),
    CODE_10050005("10050005","锁定"),
    CODE_10050006("10050006","群聊"),
    CODE_10050007("10050007","广告"),
    CODE_10050008("10050008","会务"),
    CODE_10050009("10050009","撤销"),
    CODE_10050010("10050010","分成"),

    //支付方式 1006
    CODE_10060001("10060001","微信"),
    CODE_10060002("10060002","支付宝"),

    //审核状态 1007
    CODE_10070001("10070001","待审核"),
    CODE_10070002("10070002","已审核"),
    CODE_10070003("10070003","已驳回"),

    //需求单状态 1008
    CODE_10080001("10080001","等待接单"),
    CODE_10080002("10080002","服务中"),
    CODE_10080003("10080003","待结单"),
    CODE_10080004("10080004","已结单"),
    CODE_10080005("10080005","已撤销"),
    CODE_10080006("10080006","已抢单"),

    //资讯类型 1009
    CODE_10090001("10090001","广告"),
    CODE_10090002("10090002","优惠券"),

    //资讯展示方式 1010
    CODE_10100001("10100001","一配三图"),
    CODE_10100002("10100002","一配一图"),

    //收藏类型 1011
    CODE_10110001("10110001","资讯收藏"),
    CODE_10110002("10110002","精选收藏"),

    //手机类型 1012
    CODE_10120001("10120001","安卓手机"),
    CODE_10120002("10120002","苹果手机"),

    //用户充值状态 1013
    CODE_10130001("10130001","充值成功"),
    CODE_10130002("10130002","充值失败"),

    //好友类型 1014
    CODE_10140001("10140001","好友"),
    CODE_10140002("10140002","好友群"),
    CODE_10140003("10140003","服务通知好友"),

    //好友邀请状态 1015
    CODE_10150001("10150001","邀请中"),
    CODE_10150002("10150002","同意"),
    CODE_10150003("10150003","拒绝"),

    //好友群状态 1016
    CODE_10160001("10160001","正常"),
    CODE_10160002("10160002","解散"),

    //好友在群状态 1017
    CODE_10170001("10170001","正常"),
    CODE_10170002("10170002","已退群"),
    CODE_10170003("10170003","邀请中"),
    CODE_10170004("10170004","已拒绝"),
    CODE_10170005("10170005","申请中"),
    CODE_10170006("10170006","待群主审核"),

    //聊天消息类型 1018
    CODE_10180001("10180001","文字类消息"),
    CODE_10180002("10180002","图片类消息"),

    //聊天方式 1019
    CODE_10190001("10190001","私聊"),
    CODE_10190002("10190002","群聊"),

    //消息阅读状态 1020
    CODE_10200001("10200001","未阅读"),
    CODE_10200002("10200002","已阅读"),

    //执行状态 1021
    CODE_10210001("10210001","未执行"),
    CODE_10210002("10210002","执行中"),
    CODE_10210003("10210003","执行完成"),

    //资讯分类 1022
    CODE_10220001("10220001","留学"),
    CODE_10220002("10220002","移民"),
    CODE_10220003("10220003","旅游"),

    //资讯模式 1023
    CODE_10230001("10230001","原创"),
    CODE_10230002("10230002","转载"),

    //置顶标识 1024
    CODE_10240001("10240001","普通"),
    CODE_10240002("10240002","置顶"),

    //热点新闻标识 1025
    CODE_10250001("10250001","普通"),
    CODE_10250002("10250002","热点"),

    //营销赠送类型 1026
    CODE_10260001("10260001","注册赠送"),
    CODE_10260002("10260002","邀请赠送"),

    //系统版本升级开关 1027
    CODE_10270001("10270001","关闭升级"),
    CODE_10270002("10270002","打开升级"),

    //需求评价投诉状态 1028
    CODE_10280001("10280001","未投诉"),
    CODE_10280002("10280002","投诉中"),

    //需求单服务状态 1029
    CODE_10290001("10290001","已抢单"),
    CODE_10290002("10290002","服务中"),
    CODE_10290003("10290003","待结单"),
    CODE_10290004("10290004","已完结"),
    CODE_10290005("10290005","待接单"),
    CODE_10290006("10290006","待审核"),
    CODE_10290007("10290007","未抢单"),

    //用户机构申请类型 1030
    CODE_10300001("10300001","个体首次申请"),
    CODE_10300002("10300002","个体补充申请"),
    CODE_10300003("10300003","机构首次申请"),
    CODE_10300004("10300004","机构补充申请"),

    //用户机构申请图片类型 1031
    CODE_10310001("10310001","身份证正面"),
    CODE_10310002("10310002","身份证反面"),
    CODE_10310003("10310003","营业执照"),
    CODE_10310004("10310004","资质证明"),

    //第三方登录类型 1032
    CODE_10320001("10320001","微信"),
    CODE_10320002("10320002","QQ"),
    CODE_10320003("10320003","微博"),

    //用户提现账户变动类型 1033
    CODE_10330001("10330001","充值"),
    CODE_10330002("10330002","群聊收益"),
    CODE_10330003("10330003","优惠券收益"),
    CODE_10330004("10330004","提现"),

    //群聊是否收费群 1034
    CODE_10340001("10340001","公开群"),
    CODE_10340002("10340002","收费群"),

    //精选类型 1035
    CODE_10350001("10350001","广告"),
    CODE_10350002("10350002","现金券"),
    CODE_10350003("10350003","商品购买"),

    //精选内容布局位置 1036
    CODE_10360001("10360001","首页顶部"),
    CODE_10360002("10360002","首页banner"),
    CODE_10360003("10360003","首页底部"),

    //精选券使用状态 1037
    CODE_10370001("10370001","未使用"),
    CODE_10370002("10370002","已使用"),

    //精选券购买支付状态 1038
    CODE_10380001("10380001","未支付"),
    CODE_10380002("10380002","已支付"),
    CODE_10380003("10380003","已取消"),

    //服务通知类型
    CODE_10390001("10390001","服务通知"),
    CODE_10390002("10390002","好友通知"),
    CODE_10390003("10390003","群聊通知"),
    CODE_10390004("10390004","链接通知"),   //订单通知 //文章通知

    //资讯抓图列表图片类型
    CODE_10400001("10400001","矩形图片"),
    CODE_10400002("10400002","方形图片"),

    //精选申请状态
    CODE_10410001("10410001","申请中"),
    CODE_10410002("10410002","同意申请"),
    CODE_10410003("10410003","上架成功"),
    CODE_10410004("10410004","拒绝申请"),

    //系统默认账号
    CODE_10430001("10430001","城市运营官"),
    CODE_10430002("10430002","服务机构"),
    CODE_10430003("10430003","GoKong官方账号"),


    //系统默认运营官账户，必须在用户表创建。不然查询需求详情会获取不到
    SYS_CITY_MANAGER("yh100000000000000000000","系统默认运营官"),

    //系统默认服务机构
    SYS_SERVICE("yh100000000000000000001","系统默认服务机构"),

    SYS_SWK("10000","华人网官方账号"),

    ;


    private String code;
    private String msg;

    SysCode(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }


    /**
     * 根据状态码，返回控制编码的枚举实例。
     *
     * @param code 控制码
     */
    public static SysCode fromCodeName(String code) {
        for (SysCode sysCode : SysCode.values()) {
            if (sysCode.getCode().equals(code)) {
                return sysCode;
            }
        }
        return null;
    }
}
